DeviceProcessEvents
| where FileName =~ "schtasks.exe"
| where ProcessCommandLine has_any ("/create", "/change", "/delete")
| summarize Count = count() by ProcessCommandLine, FileName, FolderPath, AccountName
| where Count < 10
| order by Count desc
