DeviceProcessEvents
| where Timestamp > ago(7d)
| where FileName == "schtasks.exe"
| where ProcessCommandLine contains "/s" or ProcessCommandLine contains "/ru"
| project Timestamp, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName
